Naladchik/RUMG_DISPLAY/stm32_graphics_display_drivers-master/Drivers/stm32f1xx/lcd_io_spi.h
#include "stm32f1xx_hal.h"

/*
 * SPI LCD driver STM32F1
 * author: Roberto Benjami
 * v.2020.05
 */

//=============================================================================
/* SPI select (0, 1, 2, 3)
   - 0: software SPI driver (the pins assign are full free)
   - 1..3: hardware SPI driver (the LCD_SCK, LCD_MOSI, LCD_MISO pins are lock to hardware) */
#define LCD_SPI           1

/* SPI mode
   - 0: only TX (only to write on the display, LCD_MISO is not used)
   - 1: half duplex (LCD_MOSI is bidirectional pin, LCD_MISO is not used)
   - 2: full duplex (SPI TX: LCD_MOSI, SPI RX: LCD_MISO) */
#define LCD_SPI_MODE      2

/* SPI write and read speed
   - software SPI: 0=none delay, 1=nop, 2=CLK pin double write, 3.. = LCD_IO_Delay(LCD_SPI_SPD - 3)
   - hardware SPI clock div fPCLK: 0=/2, 1=/4, 2=/8, 3=/16, 4=/32, 5=/64, 6=/128, 7=/256 */
#define LCD_SPI_SPD_WRITE 1
#define LCD_SPI_SPD_READ  1

/* If hardware SPI pins don't are on default pins -> please setting and this macro
   (will be set at LCD_IO_Init, and set the RCC_APB2ENR_AFIOEN) */
// #define LCD_SPI_ALTERSET  AFIO->MAPR |= 1 << AFIO_MAPR_SPI1_REMAP_Pos

/* Lcd control pins assign (A..K, 0..15)
   - if hardware SPI: SCK, MOSI, MISO pins assign is lock to hardware */
#define LCD_RST           B, 8  /* If not used leave it that way */
#define LCD_RS            B, 9

#define LCD_CS            B, 2
#define LCD_SCK           A, 5
#define LCD_MOSI          A, 7
#define LCD_MISO          A, 6  /* If not used leave it that way */

/* Backlight control
   - BL: A..K, 0..15 (if not used -> X, 0)
   - BL_ON: the logical level of the active state */
#define LCD_BL            X, 0  /* If not used leave it that way */
#define LCD_BLON          0

/* When data direction change (OUT->IN) there is a display that requires extra clock
   example ST7735: 1, ILI9341: 0 */
#define LCD_SCK_EXTRACLK  0

/* DMA settings (only hardware SPI)
   - 0..2: 0 = no DMA, 1 = DMA1, 2 = DMA2
   - 1..7: DMA channel (DMA request mapping)
   - 1..3: DMA priority (0=low..3=very high) */
#define LCD_DMA_TX        0, 0, 0
#define LCD_DMA_RX        0, 0, 0

/* DMA interrupt priority (see NVIC_SetPriority function, default value: 15) */
#define LCD_DMA_IRQ_PR    15

/* In dma mode the bitmap drawing function is completed before the actual drawing.
 * If the content of the image changes (because it is in a stack), the drawing will be corrupted.
 * If you want to wait for the drawing operation to complete, set it here.
 * This will slow down the program, but will not cause a bad drawing.
 * When drawing a non-bitmap (example: FillRect), you do not wait for the end of the drawing
 * because it stores the drawing color in a static variable.
 * The "LCD_IO_DmaTransferStatus" variable is content this status (if 0 -> DMA transfers are completed)
   - 0: bitmap and fill drawing function end wait off
   - 1: bitmap drawing function end wait on, fill drawing function end wait off (default mode)
   - 2: bitmap and fill drawing function end wait on */
#define LCD_DMA_TXWAIT    1

/* DMA RX buffer [byte] (only in ...24to16 function) */
#define LCD_DMA_RX_BUFSIZE  256

/* DMA RX buffer place (only in ...24to16 function)
   - 0: stack
   - 1: static buffer
   - 2: memory manager (malloc/free) */
#define LCD_DMA_RX_BUFMODE  1

/* If LCD_DMA_RX_BUFMODE == 2 : memory management functions name */
#define LCD_DMA_RX_MALLOC   malloc
#define LCD_DMA_RX_FREE     free
/* Inlude for malloc/free functions */
#include <stdlib.h>

void  LCD_Delay (uint32_t delay);
void  LCD_IO_Init(void);
void  LCD_IO_Bl_OnOff(uint8_t Bl);

void  LCD_IO_WriteCmd8(uint8_t Cmd);
void  LCD_IO_WriteCmd16(uint16_t Cmd);
void  LCD_IO_WriteData8(uint8_t Data);
void  LCD_IO_WriteData16(uint16_t Data);

void  LCD_IO_WriteCmd8DataFill16(uint8_t Cmd, uint16_t Data, uint32_t Size);
void  LCD_IO_WriteCmd8MultipleData8(uint8_t Cmd, uint8_t *pData, uint32_t Size);
void  LCD_IO_WriteCmd8MultipleData16(uint8_t Cmd, uint16_t *pData, uint32_t Size);
void  LCD_IO_WriteCmd16DataFill16(uint16_t Cmd, uint16_t Data, uint32_t Size);
void  LCD_IO_WriteCmd16MultipleData8(uint16_t Cmd, uint8_t *pData, uint32_t Size);
void  LCD_IO_WriteCmd16MultipleData16(uint16_t Cmd, uint16_t *pData, uint32_t Size);

void  LCD_IO_ReadCmd8MultipleData8(uint8_t Cmd, uint8_t *pData, uint32_t Size, uint32_t DummySize);
void  LCD_IO_ReadCmd8MultipleData16(uint8_t Cmd, uint16_t *pData, uint32_t Size, uint32_t DummySize);
void  LCD_IO_ReadCmd8MultipleData24to16(uint8_t Cmd, uint16_t *pData, uint32_t Size, uint32_t DummySize);
void  LCD_IO_ReadCmd16MultipleData8(uint16_t Cmd, uint8_t *pData, uint32_t Size, uint32_t DummySize);
void  LCD_IO_ReadCmd16MultipleData16(uint16_t Cmd, uint16_t *pData, uint32_t Size, uint32_t DummySize);
void  LCD_IO_ReadCmd16MultipleData24to16(uint16_t Cmd, uint16_t *pData, uint32_t Size, uint32_t DummySize);

void  LCD_IO_Delay(uint32_t c);
